Repository: xolar/proddit
Catalog: r2/r2/i18n/*/LC_MESSAGES/r2.po
Languages: ro

source: thanks for your message! you should hear back from us shortly.
ro: mulţumim pentru mesaj! vei primi un răspuns cât mai curând posibil.

source: your message has been delivered
ro: mesajul tău a fost trimis

source: no title found
ro: niciun titlu găsit

source: added
ro: adăugat

source: saved
ro: salvat

source: you should be getting a verification email shortly.
ro: ar trebui să primeşti un email de verificare în curând.

source: your email has been updated
ro: adresa de email a fost actualizată

source: your email and password have been updated
ro: adresa de email şi parola au fost actualizate

source: your password has been updated
ro: parola a fost acualizată

source: see? you don't really want to leave
ro: vezi? nu vrei să pleci cu adevărat

source: replied
ro: răspuns

source: shared
ro: share-uit

source: your link has been shared.
ro: linkul tău a fost share-uit.

source: validation errors
ro: erori de validare

source: deleted
ro: şterse

source: bad image name
ro: numele imaginii necorespunzător

source: bad image
ro: imagine necorespunzătoare

source: too many images (you only get %d)
ro: prea multe imagini (primeşti doar %d)

source: claimed! now go to someone's userpage and give them a present!
ro: luat!

source: an email will be sent to that account's address shortly
ro: un email va fi trimis către adresa acestui cont în curând

source: try again tomorrow
ro: mai încearcă mâine

source: too many css classes
ro: prea multe clase css

source: redirecting...
ro: redirectare

source: error (sorry)
ro: eroare (ne pare rău)

source: reddit buttons
ro: butoane proddit

source: reddit widget
ro: widget proddit

source: bookmarklets
ro: bookmarklet-uri

source: submit
ro: trimite

source: edit this page
ro: editează pagina asta

source: yes, it's okay!
ro: da, e ok!

source: just read this first.
ro: citeşte asta întâi.

source: help
ro: ajutor

source: forbidden (%(domain)s)
ro: ( %(domain)s ) interzis

source: this reddit has been banned
ro: prodditul ăsta a fost interzis

source: please login to do that
ro: trebuie să te loghezi ca să poţi face asta

source: you need to set a valid email address to do that.
ro: trebuie să setezi o adresă de email validă pentru a face asta.

source: a url is required
ro: e necesar un url

source: you should check that url
ro: ar trebui să verifici acel url

source: care to try these again?
ro: te superi dacă încerci din nou?

source: invalid user name
ro: nume utilizator necorespunzător

source: that username is already taken
ro: acel nume de utilizator este deja luat

source: you can't send to a user that you have blocked
ro: nu poţi trimite unui utilizator blocat

source: id not specified
ro: id nespecificat

source: you can't do that
ro: nu poţi face asta

source: that comment has been deleted
ro: acel comentariu a fost şters

source: that password is unacceptable
ro: parola asta e inacceptabilă

source: invalid password
ro: parolă necorespunzătoare

source: passwords do not match
ro: parolele nu se potrivesc

source: please enter a name
ro: te rugăm să introduci un nume

source: please enter an email address
ro: te rugăm să introduci o adresă de email

source: no email address for that user
ro: utilizatorul nu are adresă de email

source: send it to whom?
ro: cui să-l trimit?

source: please enter a subject
ro: te rugăm să introduci un subiect

source: that user doesn't exist
ro: acel utilizator nu există

source: please enter a username
ro: te rugăm să introduci un nume de utilizator

source: that number isn't in the right range (%(min)d to %(max)d)
ro: acel număr nu e între limitele potrivite (%(min)d - %(max)d)

source: you used a character here that we can't handle
ro: ai folosit un caracter invalid

source: that link has already been submitted
ro: acest link a fost trimis deja

source: that reddit already exists
ro: acest proddit există deja

source: that reddit doesn't exist
ro: acest proddit nu există

source: you aren't allowed to post there.
ro: nu ai voie să afişezi aici

source: you must specify a reddit
ro: trebuie să specifici un proddit

source: that name isn't going to work
ro: acel nume nu are cum să meargă

source: you are doing that too much. try again in %(time)s.
ro: faci asta prea mult. încearcă iar în %(time)s

source: your session has expired
ro: sesiunea a expirat

source: you must accept the terms first
ro: trebuie să accepţi termenii întâi

source: that option is not valid
ro: acea opţiune nu este valabilă

source: the following emails are invalid: %(emails)s
ro: urmatoarele adrese de email sunt invalide: %(emails)s

source: please enter at least one email address
ro: te rugam sa introduci cel puţin o adresa de email

source: please only share to %(num)s emails at a time.
ro: te rog share-uieşte doar la câte %(num)s adrese de email deodată

source: please provide a date of the form mm/dd/yyyy
ro: te rog să introduci o dată de forma ll/zz/aaa

source: the dates need to be in order and not identical
ro: datele trebuie să fie în ordine şi nu identice

source: please enter a date at least %(day)s days in the future
ro: te rog să introduci o dată cu cel puţin %(day)s în viitor

source: please enter a date at least %(day)s days in the past
ro: te rog să introduci o dată cu cel puţin %(day)s în trecut

source: address problem: %(message)s
ro: problemă de adresă: %(message)s

source: card problem: %(message)s
ro: problemă de card %(message)s

source: this is too long (max: %(max_length)s)
ro: e prea lung (maxim: %(max_length)s )

source: we need something here
ro: avem nevoie de ceva aici

source: we've never seen that code before
ro: n-am mai văzut codul ăsta până acum

source: that's a piece of history now; it's too late to reply to it
ro: e deja la arhivă; prea târziu să-ţi dai cu părerea

source: too many flair css classes
ro: prea multe clase css

source: send reddit feedback
ro: trimite feedback către proddit

source: help translate reddit into your language
ro: ajută să traduci proddit

source: help translate
ro: ajută la traducere

source: create a reddit
ro: creează un proddit

source: awards
ro: premii

source: related
ro: înrudite

source: other discussions
ro: alte discuţii

source: search results
ro: rezultate căutare

source: seen it
ro: văzut

source: password
ro: parolă

source: verify email
ro: verifică email

source: reset password
ro: resetează parola

source: opt out
ro: exclude

source: welcome back
ro: bine ai revenit

source: thanks
ro: mersi

source: nice try.
ro: bună încercare

source: newest submissions
ro: cele mai noi linkuri

source: top scoring links
ro: linkuri cu top scor

source: most controversial links
ro: cele mai controversate linkuri

source: you're really bored now, eh?
ro: eşti plictisit, aşa-i?

source: overview for %(user)s
ro: privire ansamblu asupra lui %(user)s

source: comments by %(user)s
ro: comentariile lui %(user)s

source: submitted by %(user)s
ro: trimise de %(user)s

source: liked by %(user)s
ro: plăcute de %(user)s

source: disliked by %(user)s
ro: displăcute de %(user)s

source: hidden by %(user)s
ro: ascunse de %(user)s

source: profile for %(user)s
ro: profilul pentru %(user)s

source: all
ro: toate

source: unread
ro: necitite

source: comment replies
ro: răspunsuri la comentarii

source: post replies
ro: răspunsuri la link

source: messages
ro: mesaje

source: reddits
ro: proddituri

source: reddits:
ro: proddituri:

source: comments
ro: comentarii

source: over 18?
ro: peste 18?

source: promoted by you
ro: promovate de tine

source: failed to authenticate card. sorry.
ro: eroare autentificare card.

source: search failed
ro: căutarea nu a reuşit

source: please provide a first name
ro: trebuie să introduci un prenume

source: please provide a last name
ro: trebuie să introduci un nume

source: please provide an address
ro: trebuie să introduci o adresă

source: please provide your city
ro: trebuie să introduci oraşul

source: please provide your state
ro: trebuie să introduci judeţul

source: please provide your zip or post code
ro: trebuie să introduci un cod poştal

source: please pick a country
ro: alege o ţară

source: credit card numbers should be 13 to 16 digits
ro: numerele cărţilor de credit au între 13 şi 16 cifre

source: dates should be YYYY-MM
ro: datele trebuie să fie sub forma AAAA-LL

source: card verification codes should be 3 or 4 digits
ro: codurile de verificare au 3 sau 4 cifre

source: if you need backslashes, you're doing it wrong
ro: dacă ai nevoie de backslashuri, n-o faci bine

source: what's hot
ro: ce e fierbinte

source: what's new
ro: ce e nou

source: top scoring
ro: top scor

source: most controversial
ro: cele mai controversate

source: recommended
ro: recomandate

source: promote
ro: promovează

source: hot
ro: fierbinţi

source: new
ro: noi

source: old
ro: vechi

source: ups
ro: sus

source: downs
ro: jos

source: more
ro: mai multe

source: relevance
ro: relevanţă

source: controversial
ro: controversate

source: best
ro: cele mai bune

source: saved {toolbar}
ro: salvate

source: rising
ro: în creştere

source: this hour
ro: această oră

source: today
ro: ziua de azi

source: this week
ro: această săptămână

source: this month
ro: această lună

source: this year
ro: acest an

source: all time
ro: toate timpurile

source: autobanned
ro: autobanat

source: turn admin on
ro: deschide admin

source: turn admin off
ro: închide admin

source: preferences
ro: preferinţe

source: the reddit blog
ro: blogul proddit

source: buttons
ro: butoane

source: source code
ro: cod sursă

source: store
ro: magazin

source: inquire about advertising
ro: intreaba despre publicitate pe proddit

source: random
ro: la întâmplare

source: options
ro: opţiuni

source: RSS feeds
ro: feed RSS

source: friends
ro: prieteni

source: password/email
ro: parolă/email

source: delete
ro: şterge

source: compose
ro: compune

source: inbox
ro: căsuţă

source: sent
ro: trimise

source: comments {toolbar}
ro: comentarii

source: details
ro: detalii

source: other discussions (%(num)s)
ro: alte discuţii (%(num)s)

source: shirt
ro: tricou

source: home
ro: acasă

source: about
ro: despre

source: edit moderators
ro: editează moderatorii

source: edit approved submitters
ro: modifică contribuitorii aprobaţi

source: ban users
ro: ban utilizatori

source: popular
ro: populare

source: create
ro: creează

source: my reddits
ro: prodditurile mele

source: errors
ro: erori

source: promoted
ro: promovate

source: reporters
ro: raportori

source: reported links
ro: linkuri raportate

source: reported authors
ro: autori raportaţi

source: overview
ro: privire de ansamblu

source: submitted
ro: trimise

source: liked
ro: plăcute

source: disliked
ro: neplăcute

source: hidden {toolbar}
ro: ascunse

source: reported
ro: raportate

source: self-serve advertising
ro: auto-servire

source: create promotion
ro: creează promoţie

source: my promoted links
ro: linkurile mele promovate

source: all promoted links
ro: toate linkurile promovate

source: roadblock
ro: blocat

source: live
ro: în direct

source: unpaid
ro: neplătit

source: pending
ro: în aşteptare

source: rejected
ro: respinge

source: sorted by
ro: sortate după

source: kind
ro: fel

source: links from
ro: linkuri din

source: day
ro: zi

source: that link has already been submitted, but you can try to [submit it again](%s).
ro: acel link a fost postat deja, dar poţi încerca să-l [postezi din nou]( %s ).

source: that link has been submitted to multiple reddits. you can try to [submit it again](%s).
ro: acel link a fost postat deja pe mai multe proddituri. poţi încerca însă să îl [postezi din nou]( %s ).

source: your account has been deleted, but we won't judge you for it.
ro: contul tău a fost şters, dar cine suntem noi să te judecăm pentru asta

source: you'll need to login or register to do that
ro: trebuie sa te loghezi sau să te înregistrezi sa faci asta

source: (don't worry, it only takes a few seconds)
ro: (nu-ţi fă griji, durează doar câteva secunde)

source: I understand and agree that registration on or use of this site constitutes agreement to its %(user_agreement)s and %(privacy_policy)s.
ro: (c) 2011 proddit.com

source: to view reddit with only submissions from your friends, use [reddit.com/r/friends](%s)
ro: pentru a vizualiza proddit.com cu linkuri trimise doar de prietenii tăi, foloseşte [proddit.com/r/friends]( %s )

source: your reddit has been created
ro: prodditul tău a fost creat

source: we haven't yet decided whether these things are spam, so you have a chance to change your vote:
ro: nu ne-am hotărât dacă e spam, deci ai şansa să votezi:

source: it's too late to change your vote on these things (the verdict has been issued):
ro: prea târziu să votezi (verdictul a fost dat)

source: visit [%(link)s](%(link)s) for more information
ro: vizitează [%(link)s](%(link)s) pentru mai multe informaţii

source: you have been added as a moderator to [%(title)s](%(url)s).
ro: ai fost adăugat ca moderator la [ %(title)s ]( %(url)s ).

source: you have been banned from posting to [%(title)s](%(url)s).
ro: ţi-a fost interzis să contribui pe [ %(title)s ]( %(url)s ).

source: you have been added to the list of users able to see [traffic for the sponsored link "%(title)s"](%(traffic_url)s).
ro: aici poţi vedea [nişte statistici "%(title)s"](%(traffic_url)s)

source: you are a moderator
ro: eşti moderator

source: you are an approved submitter
ro: eşti un contribuitor aprobat

source: you've been banned
ro: ai fost banat

source: you can view traffic on a promoted link
ro: poţi vedea traficul la un link promovat

source: you have not subscribed to any reddits.
ro: nu te-ai abonat la nici un proddit.

source: below are the reddits you have subscribed to
ro: mai jos sunt prodditurile la care te-ai abonat

source: below are the reddits that you have moderator access to.
ro: mai jost sunt prodditurile la care ai acces de moderator

source: click the `+frontpage` or `-frontpage` buttons to choose which reddits appear on your front page.
ro: apasă pe "+primapagină" sau pe "-primapagină" pentru a alege ce proddituri să apară pe prima ta pagină

source: you're searching within the [%(reddit_name)s](%(reddit_link)s) reddit. you can also search within [all reddits](%(all_reddits_link)s)
ro: cauţi în prodditul [%(reddit_name)s](%(reddit_link)s).

source: "%(brokenurl)s" is not a valid URL
ro: " %(brokenurl)s " nu e un link valid

source: "%(cssprop)s" is not a valid CSS property
ro: " %(cssprop)s " nu e o proprietate CSS validă

source: "%(cssvalue)s" is not a valid value for CSS property "%(cssprop)s"
ro: " %(cssvalue)s " nu e o valoare validă pentru " %(cssprop)s "

source: too big. keep it under %(max_size)dkb
ro: prea mare. trebuie să fie sub %(max_size)dkb

source: @imports are not allowed
ro: @imports-urile nu sunt permise

source: invalid CSS property list "%(proplist)s"
ro: lista "%(proplist)s" este invalidă

source: unknown CSS rule type "%(ruletype)s"
ro: rule type "%(ruletype)s" necunoscut

source: to anything interesting: news article, blog entry, video, picture...
ro: cu orice interesant: articol de ştiri, blog entry, video, poză...

source: %(author)s comments on %(title)s
ro: comentariile lui %(author)s la %(title)s

source: The following is a sample of what Reddit users had to say about this page. The full discussion is available [here](%(fd_link)s); you can also get there by clicking the link's title (in the middle of the toolbar, to the right of the comments button).
ro: Ce urmează sunt unele comentarii ale unor utilizatori proddit despre acest link. Discuţia completă se află [aici](%(fd_link)s); mai poţi ajunge acolo dând click pe titlul linkului (în mijlocul toolbarului).

source: You are submitting a link. The key to a successful submission is interesting content and a descriptive title.
ro: Trimiţi un link. Cheia succesului este conţinutul interesant şi titlul descriptiv.

source: You are submitting a text-based post. Speak your mind. A title is required, but expanding further in the text field is not. Beginning your title with "vote up if" is violation of intergalactic law.
ro: Trimiţi un link tip text. Un titlu este necesar, textul propriu zis, nu.

source: we're going to need to verify your email address for you to proceed.
ro: trebuie să-ţi verificăm adresa de email pentru a continua

source: you'll be able to submit more frequently once you verify your email address
ro: vei putea trimite mai des dacă îţi verifici adresa

source: your email address has been verfied
ro: adresa de email a fost verificată

source: Verification failed. Please try that again
ro: verificarea nu a reuşit, te rugăm să reîncerci

source: Our search machines are under too much load to handle your request right now. :( Sorry for the inconvenience. [Try again](%(link)s) in a little bit -- but please don't mash reload; that only makes the problem worse.
ro: Căutarea nu a funcţionat. Poţi încerca [iar]( %(link)s ), dar nu prea curând.

source: comment
ro: comentariu

source: point
ro: punct

source: message
ro: mesaj

source: subreddit
ro: proddit

source: reader
ro: utilizator

source: subscriber
ro: abonat

source: milliseconds
ro: milisecundă

source: second
ro: secundă

source: minute
ro: minut

source: hour
ro: oră

source: month
ro: lună

source: year
ro: an

source: comment {verb}
ro: comentează

source: friend
ro: prieten

source: submitter
ro: expeditor

source: reddit admin, speaking officially
ro: admin proddit, vorbind oficial

source: Submit a link
ro: Trimite un link

source: moderators
ro: moderatori

source: admin box
ro: căsuţa adminului

source: Recently viewed links
ro: Linkuri recent vizualizate

source: site links
ro: linkuri

source: FAQ
ro: FAQ (engleză)

source: reddit tools
ro: tool-uri

source: brothers
ro: prieteni

source: login or register
ro: loghează-te sau înregistrează-te

source: bummer
ro: ghinion

source: this page is no longer available due to a copyright claim.
ro: pagina asta nu mai este disponibilă din motive de copyright

source: about %(site)s
ro: despre %(site)s

source: search reddits
ro: cauta proddituri

source: what's this?
ro: ce e asta?

source: trophy case
ro: trofee

source: an unknown amount
ro: o cantitate necunoscută

source: less than a day
ro: mai puţin de o zi

source: page not found
ro: pagina nu a fost găsită

source: you aren't allowed to do that.
ro: nu ai voie să faci asta

source: %s visible
ro: %s vizibil

source: try entering those letters again
ro: încearcă să introduci literele încă o dată

source: previous search
ro: căutarea precedentă

source: This feature is currently unavailable. Sorry
ro: Această funcţionalitate este momentan indisponibilă. Ne pare rău.

source: add a friend
ro: adaugă un prieten

source: your friends
ro: prietenii tăi

source: add approved submitter
ro: adaugă un contribuitor aprobat

source: add moderator
ro: adaugă moderatori

source: banned users
ro: utilizatori banaţi

source: share traffic
ro: shareuieşte trafic

source: current viewers
ro: vizitatorii curenţi

source: moderator of /r/%(reddit)s, speaking officially
ro: moderator al /r/%(reddit)s, vorbind oficial

source: comment score below threshold
ro: scorul comentariului sub prag

source: comment reply
ro: răspunde

source: post reply
ro: răspunde

source: [message from blocked user]
ro: [mesaj de la user blocat]

source: [unblock user to see this message]
ro: [deblochează utilizatorul să vezi mesajul]

source: [reddit] %(user)s has shared a link with you
ro: [proddit] %(user)s a share-uit un link cu tine

source: [feedback] feedback from '%(user)s'
ro: [feedback] feedback de la '%(user)s'

source: [ad_inq] feedback from '%(user)s'
ro: [ad_inq] feedback de la '%(user)s'

source: [reddit] email removal notice
ro: [proddit] notificare scoatere email din lista proddit

source: [reddit] email addition notice
ro: [proddit] notificare adăugare email

source: [reddit] reset your password
ro: [proddit] resetează-ţi parola

source: [reddit] verify your email address
ro: [proddit] verifică-ţi adresa de email

source: [reddit] your bid has been accepted
ro: [proddit] licitaţia ţi-a fost acceptată

source: [reddit] your promotion has been accepted
ro: [proddit] promoţia ţi-a fost acceptată

source: [reddit] your promotion has been rejected
ro: [proddit] promoţia ţi-a fost respinsă

source: [reddit] your promotion is now live
ro: [proddit] promoţia ta este live

source: [reddit] your promotion has finished
ro: [proddit] promoţia ta a luat sfârşit

source: [reddit] your promotion has been created
ro: [proddit] promoţia a fost creată

source: [i18n] translation offer from '%(user)s'
ro: [i18n] '%(user)s' vrea să traducă

source: on reddit.com
ro: pe proddit.com

source: disable
ro: dezactivează

source: disabled
ro: dezactivat

source: enable
ro: activează

source: enabled
ro: activat

source: add authors
ro: adaugă autori

source: /* Custom css: use this block to insert special translation-dependent css in the page header */
ro: /* css personalizat: foloseşte acest bloc pentru a insera css dependent de traduceri în headerul paginii */

source: links from %(site)s
ro: linkuri de la %(site)s

source: install the %(site)s bookmarklet set
ro: instalează setul de bookmarklet-uri %(site)s

source: once added to your bookmark bar, you can click these buttons from any site to get quick access to reddit functionality.
ro: odată adăugate pe bara de bookmarkuri, poţi da click pe butoane de pe orice site având acces la funcţionalitatea proddit.

source: in Firefox
ro: în Firefox

source: click and drag
ro: click şi trage

source: to your bookmark bar.
ro: pe bara de bookmarkuri.

source: in Internet Explorer
ro: în Internet Explorer

source: right-click on
ro: click-dreapta

source: then choose "Add to Favorites" and add to the "Links" folder.
ro: apoi alege "Add to Favorites" şi trage pe directorul "Links"

source: in Safari
ro: în Opera

source: voila! now you have all the functionality of %(site)s in your toolbar.
ro: acum ai toate funcţionalităţile %(site)s pe toolbar

source: put %(site)s buttons on your site
ro: pune butoane %(site)s pe site-ul tău

source: the reddit button is the smart way to get your content submitted to and discussed on reddit. pick the button you like from below, and then copy/paste the code into your HTML editor.
ro: butonul proddit e o cale uşoară de a-ţi trimite linkurile spre proddit. alege unul din butoanele de mai jos şi dă copy-paste la cod în editorul tău de HTML.

source: commonly used buttons
ro: butone uzuale

source: use one of these buttons to quickly add reddit links to your site, or see below for more options.
ro: foloseşte unul dintre butoane pentru a adăuga linkuri proddit spre site-ul tău. uită-te mai jos pentru alte opţiuni.

source: buttons with points
ro: butoane cu puncte

source: customizing the look of your buttons
ro: personalizează felul cum arată butoanele

source: the buttons with points have three additional options.
ro: butoanele cu puncte au 3 opţiuni adiţionale

source: no styles will be added, so you can style it yourself
ro: nu sunt adăugate stiluri ca să le poţi aranja cum vrei

source: specify a url to use instead of the current url
ro: specifică alt url decât cel de aici

source: opens links in a new window
ro: deschide linkurile într-o pagină nouă

source: Example:
ro: Exemplu:

source: simple interactive button
ro: buton simplu interactiv

source: put this code on your page:
ro: pune codul acesta pe pagina ta

source: and you'll get something like this:
ro: şi vei obţine ceva de genul acesta:

source: more interactive buttons
ro: mai multe butoane interactive

source: interactive button advanced settings
ro: setări avansate pentru butoane

source: specify a url
ro: specifică un url

source: useful in places like blogs, where you want to link to the post's permalink
ro: folositor de exemplu pe bloguri, unde vrei să legi către linkul articolului
