Repository: xolar/proddit
Catalog: r2/r2/i18n/*/LC_MESSAGES/r2.po
Languages: ro

source: the code
ro: codul

source: add this into your HTML where you want the %(site)s links displayed
ro: adaugă asta în HTML-ul tău unde vrei să apară linkurile %(site)s

source: Funny 500 page message 1
ro: M-ai bulit...

source: Funny 500 page message 2
ro: M-ai nenorocit...

source: Funny 500 page message 3
ro: M-ai stricat...

source: Funny 500 page message 4
ro: Evil monkey got me!

source: Funny 500 page message 5
ro: Whoooooooops!

source: Funny 500 page message 6
ro: M-a prins flama violet!

source: Funny 500 page message 7
ro: BUM!

source: Funny 500 page message 8
ro: Ce ai facut că nu mai merge?!

source: Funny 500 page message 9
ro: M-ai aranjat bine!

source: Funny 500 page message 10
ro: Kaputt!

source: Reason to create a reddit 1
ro: ...pentru ca informaţia să curgă mai eficient în birou.

source: Reason to create a reddit 2
ro: ...pentru că n-ai cu cine.

source: Reason to create a reddit 3
ro: ...pentru că poţi.

source: Reason to create a reddit 4
ro: ..pentru cei care n-au votat.

source: Reason to create a reddit 5
ro: ...pentru trupa ta.

source: Reason to create a reddit 6
ro: ...pentru guilda ta de wow.

source: Reason to create a reddit 7
ro: ...pentru hobby-ul tău.

source: Reason to create a reddit 8
ro: ...pentru pisica ta.

source: Reason to create a reddit 9
ro: ...pentru câinele tău.

source: Reason to create a reddit 10
ro: ...pentru că urăşti libertatea.

source: Reason to create a reddit 11
ro: ...pentru limbajul de programare preferat.

source: Reason to create a reddit 12
ro: ...pentru subiectul tău favorit.

source: Reason to create a reddit 13
ro: ...pentru echipa ta favorită.

source: Reason to create a reddit 14
ro: ...pentru că ai prea mult timp.

source: Reason to create a reddit 15
ro: ...pentru că eşti plin de câştig.

source: Reason to create a reddit 16
ro: ...sudo creează propriul tău proddit.

source: Reason to create a reddit 17
ro: ...pentru prietenii tăi.

source: Reason to create a reddit 18
ro: ...pentru maşina ta favorită.

source: Reason to create a reddit 19
ro: ...pentru că vrei să vezi câţi dau join.

source: Reason to create a reddit 20
ro: ...pentru melci.
