Repository: xolar/proddit
Catalog: r2/r2/i18n/*/LC_MESSAGES/r2.po
Languages: ro

source: specify a community to target
ro: specifică o comunitate

source: specify a title
ro: specifică un titlu

source: open links in a new window
ro: deschide linkurile într-o nouă fereastră

source: specify the color
ro: specifică o culoare

source: specify a border color
ro: specifică o culoare a marginilor

source: to make this button:
ro: pentru a face butonul acesta:

source: use this code:
ro: foloseşte codul acesta:

source: view code
ro: vezi codul

source: hide code
ro: ascunde codul

source: Vote on this article
ro: Votează acest articol

source: human?
ro: om?

source: type the letters from the image above
ro: introdu literele

source: clear
ro: şterge

source: by
ro: de

source: deleted comment from
ro: comentariu şters de la

source: [deleted]
ro: [şters]

source: ago
ro: în urmă

source: child
ro: copil

source: on
ro: pe

source: This sidebar will automatically appear when there are comments.
ro: Aceasta bară va fi afişată automat când există comentarii.

source: This sidebar will not be shown automatically.
ro: Această bară nu va fi afişată automat.

source: You've been here before. To highlight comments that were posted since one of your visits, select it below:
ro: Ai mai fost aici. Pentru a marca comentariile care au fost postate de la una din vizitele tale, selectează de jos:

source: no highlighting
ro: nu marca

source: that subreddit doesn't exist, but you can create it here.
ro: acel proddit nu există, dar poţi să-l creezi aici.

source: no spaces, e.g., slashdot
ro: fără spaţii, de ex. bererece

source: e.g., slashdot: news for nerds, stuff that matters
ro: de ex. bererece: berea bună-i berea rece

source: 500 characters max. Make them count.
ro: maxim 500 caractere

source: anyone can view and submit
ro: oricine poate vizualiza şi trimite

source: anyone can view, but only some are approved to submit links
ro: oricine poate vedea, dar numai unii ai voie să posta linkuri

source: private
ro: privat

source: only approved members can view and submit
ro: doar membrii aprobaţi pot vedea şi posta

source: content options
ro: opţiuni pentru conţinut

source: any link type is allowed
ro: orice tip de link e aprobat

source: only links to external sites are allowed
ro: doar linkuri către alte situri sunt aprobate

source: text posts only
ro: doar linkuri de tip text

source: only text/self posts are allowed
ro: doar linkuri de tip text sunt permise

source: viewers must be over eighteen years old
ro: vizitatorii trebuie să aibă peste 18 ani

source: domain
ro: domeniu

source: hide help
ro: ascunde ajutor

source: upload header image
ro: încarcă imagine header

source: enter link url here
ro: bagă url aici

source: save options
ro: salvează opţiuni

source: reddit this ad
ro: comentează acest ad

source: your name
ro: numele tău

source: send
ro: trimite

source: jump to user (or add):
ro: sari la user (sau adaugă)

source: back to full list
ro: înapoi la toată lista

source: back to the beginning
ro: înapo la început

source: flair text
ro: text fler

source: css class
ro: clasa css

source: prev
ro: înapoi

source: next
ro: înainte

source: flair settings
ro: setări fler

source: position flair to the left of the username
ro: poziţionează fler la stânga numelui

source: right
ro: dreapta

source: position flair to the right of the username
ro: poziţionează fler la dreapta numelui

source: show url
ro: arată url

source: hide url
ro: ascunde url

source: load a random link
ro: încarcă un link la întâmplare

source: serendipity
ro: la întâmplare

source: visit your userpage
ro: vizitează pagina utilizatorului

source: login / register
ro: login / înregistrează-te

source: new mail
ro: email

source: visit this link without the toolbar
ro: vizitează acest link fără toolbar

source: click to visit the main page for this submission
ro: click pentru a vizita pagina principală a acestui link

source: click to submit this link to reddit
ro: click pentru a trimite acest link pe proddit

source: vote %(direction)s
ro: votează %(direction)s

source: like
ro: place

source: dislike
ro: displace

source: unsave
ro: nu salva

source: unsaved
ro: nesalvat

source: save
ro: salvează

source: unhide
ro: arată

source: unhidden
ro: neascuns

source: hide
ro: ascunde

source: toggle the comments panel
ro: comută panoul de comentarii

source: Adult content: Not Safe For Work
ro: Conţinut pentru adulţi: Not Safe For Work

source: (no need to click for this info; just hover over the checkmark next time)
ro: (nu e nevoie să dai click pentru informaţia asta; doar mişcă mouse-ul peste semn data viitoare)

source: submitted %(when)s ago by %(author)s to %(reddit)s
ro: trimis acum %(when)s de %(author)s la %(reddit)s

source: submitted %(when)s ago by %(author)s
ro: trimis acum %(when)s de %(author)s

source: this post was submitted on
ro: acest link a fost trimis pe

source: like it
ro: plăcut

source: up vote
ro: vot în sus

source: down vote
ro: vot în jos

source: reddit's spam filter needs your help!
ro: filtrul de spam are nevoie de ajutorul tău!

source: how would you classify this link?
ro: cum ai clasifica acest link?

source: thanks for voting!
ro: mersi de vot

source: Click here for more info.
ro: Click aici pentru mai multe informaţii.

source: those arrows are only for show; they don't actually do anything.
ro: săgeţile astea sunt doar de formă; nu fac nimic de fapt

source: view more:
ro: vezi mai multe:

source: there doesn't seem to be anything here
ro: se pare că nu e nimic aici

source: you are logged in. go use the site!
ro: eşti logat!

source: username
ro: utilizator

source: optional
ro: opţional

source: verify password
ro: verifică parola

source: remember me
ro: ţine-mă minte

source: recover password
ro: recuperează parola

source: create account
ro: creează cont

source: create a new account
ro: creează un nou cont

source: all it takes is a username and password
ro: tot ce trebuie e un nume şi o parolă

source: is it really that easy? only one way to find out...
ro: e aşa simplu? e un singur mod de a afla...

source: already have an account and just want to login?
ro: ai deja un cont şi vrei să te loghezi?

source: from %(author)s sent %(when)s ago
ro: de %(author)s trimis acum %(when)s

source: to %(dest)s sent %(when)s ago
ro: la %(dest)s trimis acum %(when)s

source: to %(dest)s from %(author)s sent %(when)s ago
ro: la %(dest)s de la %(author)s trimis acum %(when)s

source: expand all
ro: deschide toate

source: collapse all
ro: închide toate

source: show parent
ro: afişează părinte

source: send a message
ro: trimite un mesaj

source: load more comments
ro: încarcă mai multe comentarii

source: reply
ro: raspuns

source: [+] load the full conversation.
ro: [+] încarcă toată conversaţia

source: continue this thread
ro: continuă acest thread

source: submit to reddit
ro: trimite pe proddit

source: suggest title
ro: sugerează titlu

source: (optional)
ro: opţional

source: The address '%(email)s' will no longer receive email from us.
ro: Această adresă %(email)s nu va mai primi email de la noi.

source: A confirmation email has been queued up and should be reaching you shortly. It will be the last you hear of us.
ro: Un email de confirmare va ajunge la tine în scurt timp. Va fi ultimul lucru ce-l auzi de la noi.

source: Would you like the address %(email)s to no longer receive email from us?
ro: Doreşti ca adresa %(email)s să nu mai primească email-uri de la noi?

source: yes
ro: da

source: no
ro: nu

source: '%(email)s' has been removed from our block list.
ro: Adresa %(email)s a fost reactivată pe lista noastră.

source: Allow '%(email)s' to receive email from us?
ro: Acceptă ca %(email)s să primească email de la noi?

source: you must be at least eighteen to view this reddit
ro: trebuie să ai cel puţin optsprezece ani ca să intri aici.

source: are you over eighteen and willing to see adult content?
ro: ai peste optsprezece ani şi eşti dispus să vizualizezi conţinut pentru adulţi?

source: what's my password?
ro: care mi-e parola?

source: enter your user name below to receive your login information
ro: introdu numele de utilizator pentru a primi informaţiile de login

source: password reset link expired. please try again
ro: linkul de resetare a expirat. încearcă te rog din nou

source: email me
ro: trimite-mi email

source: edit
ro: editează

source: you are viewing a single comment's thread.
ro: vizualizezi firul unui singur comentariu

source: view the rest of the comments
ro: vizualizează restul comentariilor

source: are you sure?
ro: eşti sigur?

source: delete your reddit account? hope you have a good reason.
ro: ştergi contul tău de proddit? sper că ai un motiv bun.

source: deleting...
ro: ştergere...

source: Private RSS feeds
ro: feed RSS privat

source: On this page are links to private RSS feeds so that you can get listings of your content (personalized front page, message panel, saved listing, etc.) without having to deal with cookies or other auth.
ro: Pe pagina aceasta sunt link-uri către feed-uri RSS private, (ce îţi permit accesarea paginii principale personalizate, panoul de mesaje, linkurile salvate, etc.) fără să mai trebuiască să-ţi baţi capul cu cookies sau alt fel autentificare

source: Keep in mind that these urls are intended to be private, so **share at your own risk.**
ro: Ţine minte că aceste url-uri sunt private, deci *împărtăşeşte-le pe risc propriu*

source: All feeds are invalidated if you change your password, however.
ro: Toate feed-urile sunt invalidate la schimbarea parolei.

source: your front page
ro: prima pagină a ta

source: your saved links
ro: linkurile tale salvate

source: links you've liked
ro: link-uri plăcute

source: links you've disliked
ro: link-uri displăcute

source: links you've hidden
ro: link-uri ascunse

source: everything
ro: tot

source: unread messages
ro: mesaje necitite

source: messages only
ro: doar mesaje

source: comment replies only
ro: răspunsuri la comentarii

source: self-post replies only
ro: doar răspunsuri din postări *self*

source: your preferences have been updated
ro: preferinţele tale au fost actualizate

source: interface language
ro: limba interfeţei

source: incomplete
ro: incomplet

source: volunteer to translate
ro: ajută la traducere

source: content language
ro: limba conţinutului

source: clicking options
ro: opţiuni

source: display links with a reddit toolbar
ro: afişează linkurile cu un toolbar

source: show thumbnails next to links
ro: arată imagini thumbnail

source: don't show thumbnails next to links
ro: nu arata imagini thumbnail

source: show thumbnails based on that reddit's media preferences
ro: arată imagini thumbnail în funcţie de setările acelui proddit

source: to enable thumbnails, disable compressed link display
ro: pentru a activa imaginile thumbnail, dezactiveaza linkurile comprimate

source: link options
ro: opţiuni pentru linkuri

source: (it shows new and promoted links, and gives you a say in what's spam and what isn't.)
ro: (te putem întreba şi dacă vreun link e spam sau nu)

source: show me new links on the front page
ro: arată linkuri noi pe prima pagină

source: show me links I've recently viewed
ro: arată-mi linkuri ce le-am văzut de curând

source: compress the link display
ro: comprima afisarea linkurilor

source: don't show links after i've liked them
ro: ascunde linkurile dupa ce le-am plăcut

source: (except my own)
ro: (în afară de al meu)

source: don't show links after i've disliked them
ro: ascunde linkurile după ce mi-au displăcut

source: display
ro: afisează

source: links at once
ro: linkuri deodată

source: don't show me sites with a score less than
ro: nu-mi arata linkuri cu un scor mai mic decât

source: don't show me comments with a score less than
ro: nu-mi arata comentarii cu un scor mai mic decât

source: comments by default
ro: comentarii

source: display %(num)s links at once
ro: arată %(num)s linkuri deodată

source: don't show me sites with a score less than %(num)s
ro: nu-mi arata linkuri cu un scor mai mic decât %(num)s

source: (blank for none)
ro: (lasă gol pentru niciunul)

source: comment options
ro: opţiuni pentru comentarii

source: don't show me comments with a score less than %(num)s
ro: nu-mi arata comentarii cu un scor mai mic decât %(num)s

source: display %(num)s comments by default
ro: arată %(num)s comentarii implicit

source: the smaller the number, the faster your comments pages will load
ro: cu cât mai mic numărul, cu atât mai rapid se încarcă pagina

source: messaging options
ro: opţiuni de mesaje

source: show message conversations in the inbox
ro: arată conversaţiile în inbox

source: (only applies when you go to the 'messages' panel)
ro: (se aplică doar când te duci în panoul de mesaje)

source: collapse messages after I've read them
ro: ascunde linkurile dupa ce le-am citit

source: (otherwise, you'll have to collapse them yourself)
ro: (altfel va trebui să le ascunzi singur)

source: mark messages as read when I open my inbox
ro: marchează mesajele ca şi citite când deschid inbox-ul

source: (otherwise, they will be marked as read when you click them)
ro: (altfel vor fi marcate când dai click pe ele)

source: display options
ro: optiuni de afişare

source: allow reddits to show me custom styles
ro: permite prodditurilor să-mi arate stiluri personalizate

source: show promote tab on front page
ro: arată tabul de promoţii pe prima pagină

source: i am over eighteen years old and willing to view adult content
ro: am peste optsprezece ani şi sunt de acord să vizualizez conţinut pentru adulţi

source: required to view some reddits
ro: necesar pentru unele proddituri

source: label posts that are not safe for work (NSFW)
ro: marchează linkurile care nu sunt sigure pentru lucru (nsfw)

source: enable private RSS feeds
ro: activează feed-urile RSS private

source: (available from the 'RSS feed' tab in prefs)
ro: (disponibile din tabul 'feed RSS' din preferinţe)

source: privacy options
ro: opţiuni de intimitate

source: make my votes public
ro: fă-mi voturile publice

source: let everyone see %(link1)s and %(link2)s
ro: permite tuturor să vadă %(link1)s şi %(link2)s

source: allow my data to be used for research purposes
ro: permite ca datele să fie folosite în statistici

source: don't allow search engines to index my user profile
ro: nu permite motoarelor de căutare să-mi indexe profilul

source: load core JS libraries from reddit servers
ro: încarcă librăriile JS de pe serverul proddit

source: update your email or password
ro: actualizează-ţi adresa de email sau parola

source: verify your email
ro: verifică-ţi adresa de email

source: update your email
ro: actualizează-ţi adresa de email

source: update your password
ro: actualizează-ţi parola

source: not set
ro: nesetată

source: verified
ro: verificată

source: verification pending
ro: verificare în curs de procesare

source: click to resend
ro: click pentru a retrimite

source: unverified
ro: neverificată

source: click to verify
ro: click pentru a verifica

source: (required)
ro: (necesar)

source: send verification email
ro: trimite email de verificare

source: indicted
ro: acuzat

source: remove
ro: şterge [M]

source: removed
ro: şters

source: report
ro: raportează

source: distinguishing...
ro: marcare...

source: distinguish
ro: marchează

source: distinguish this?
ro: marchează asta?

source: confirm %(obj)s removal
ro: confirmă ştergerea %(obj)s

source: reapprove %(obj)s
ro: reaprobă %(obj)s

source: approve %(obj)s
ro: aprobă %(obj)s

source: cancel
ro: anulează

source: hidden
ro: ascunse

source: reject
ro: respinge

source: accept
ro: acceptă

source: accepted
ro: acceptat

source: traffic
ro: trafic

source: questionable submission; you should remove it or approve it
ro: link dubios; fie îl ştergi, fie îl aprobi

source: parent
ro: părinte

source: reply {verb}
ro: răspunde

source: mark unread
ro: marchează ca necitit

source: toggle
ro: comută

source: unban
ro: debanează

source: unbanned
ro: debanat

source: banned
ro: banat

source: + friends
ro: +prieteni

source: - friends
ro: -prieteni

source: link karma
ro: karma linkuri

source: comment karma
ro: karma comentarii

source: send message
ro: trimite mesaj

source: total promotion traffic
ro: trafic total promoţie

source: historical site performance
ro: istoric performanţă site

source: top promoters this month
ro: top promoteri luna aceasta

source: promotions this month
ro: promoţii de luna asta

source: Promotion Traffic
ro: trafic de promoţie

source: (download as .csv)
ro: (download ca .csv)

source: close this window
ro: închide fereastra

source: (c) %(year)d Conde Nast Digital. All rights reserved.
ro: (c) 2011 proddit.com

source: jump to content
ro: sari la conţinut

source: want to join? %(register)s in seconds
ro: vrei să ni te alături? %(register)s pe loc

source: register
ro: înregistrează-te

source: date
ro: data

source: uniques
ro: unice

source: impressions
ro: impresii

source: subscriptions
ro: editează lista

source: Daily Mean
ro: media zilnică

source: There doesn't seem to be any traffic data at the moment. Please check back later.
ro: nu pare a fi trafic în momentul de faţă. încearcă mai târziu

source: satisfied?
ro: satisfăcut?

source: thanks for your feedback!
ro: mersi de feedback

source: find things posted in {name} only
ro: găseşte linkuri doar în (name)

source: return things submitted by {username} only
ro: întoarce linkuri trimise doar de (username)

source: get links to pages on {domain} only
ro: doar de pe (domain)

source: search for {text} in url
ro: caută după (text) în url

source: search for {text} in self post contents
ro: caută după (text) în linkuri de tip text

source: include or exclude self posts
ro: include sau exclude linkuri de tip text

source: include or exclude results from nsfw reddits
ro: include linkuri din comunităţi NSFW

source: see the search faq for details.
ro: vezi faq pentru detalii (pe reddit)

source: advanced search: by author, community...
ro: căutare avansată: după autor, comunitate

source: search reddit
ro: caută pe proddit

source: limit my search to %(path)s
ro: limitează căutarea la %(path)s

source: There is currently %(num_comments)s on this link. You can view it here:
ro: Există momentan %(num_comments)s pentru acest link. Îl poţi vizualiza aici:

source: send this link to
ro: trimite link la

source: your email
ro: adresa ta de email

source: message {share form}
ro: mesaj

source: %(user)s from http://%(site)s/ has shared a link with you.
ro: %(user)s de la http://%(site)s/ ţi-a trimis un link.

source: sorry. That title is too long to fit on a t-shirt.
ro: prea lung pentru a încăpea pe tricou

source: Your reddit headline shirt
ro: Tricoul cu titlul proddit

source: Color
ro: culoare

source: Size
ro: mărime

source: Style
ro: stil

source: Qty:
ro: cantitate:

source: Click %(here)s to close help.
ro: Click %(here)s să închizi help-ul.

source: here
ro: aici

source: Sometimes reddit needs to ask the community to help fight spam. This is your chance to take part in that.
ro: ia parte la lupta împotriva spamului

source: This element has been disabled.
ro: Acest element a fost dezactivat.

source: Click %(here)s to disable this feature.
ro: Click %(here)s pentru a dezactiva funcţionalitatea asta.

source: This area shows new and upcoming links. Vote on links here to help them become popular, and click the forwards and backwards buttons to view more.
ro: Aici apar noile linkuri. Voteaza linkurile aici sa devina populare. Click inainte si inapoi pentru a vedea mai multe.

source: The new link area will no longer appear for you. To re-enable it, visit your preferences.
ro: Noile linkuri nu-ţi vor mai apărea. Pentru a reactiva funcţionalitatea intră la preferinţe.

source: a community for %(time)s
ro: o comunitate de %(time)s

source: + frontpage
ro: +primapagină

source: - frontpage
ro: -primapagină

source: over18
ro: peste18

source: leave
ro: renunţă

source: Show my flair on this reddit. It looks like:
ro: Arată flerul meu pe prodditul ăsta. Arată aşa:

source: you are a moderator of this reddit. (%(leave)s)
ro: eşti un moderator al acestui proddit. (%(leave)s)

source: stop being a moderator?
ro: renunţi a fi moderator?

source: you are no longer a moderator
ro: nu mai eşti moderator

source: ban this reddit
ro: banează acest proddit

source: show the default stylesheet
ro: arată stylesheet-ul implicit

source: hide the default stylesheet
ro: ascunde stylesheet-ul implicit

source: preview
ro: previzualizează

source: images
ro: imagini

source: image file
ro: fişier imagine

source: new image name:
ro: nume nou imagine:

source: (image names should consist of alphanumeric characters and '-' only)
ro: (numele imaginilor trebuie să conţina doar caractere alfanumerice şi '-')

source: Note: any changes to images here will be reflected immediately on reload and cannot be undone.
ro: Notă: orice schimbări ale imaginilor se vor reflecta imediat la reîncărcare şi nu pot fi reschimbate.

source: please select an image
ro: te rugăm selectează o imaginre

source: paste into stylesheet
ro: paste în stylesheet

source: delete this image
ro: şterge imaginea aceasta

source: normal link
ro: link normal

source: compressed link
ro: link comprimat

source: link with thumbnail
ro: link cu imagine

source: thanks for subscribing!
ro: mersi pentru înscriere

source: dust
ro: praf

source: %d more
ro: %d mai multe

source: the page you requested does not exist
ro: pagina cerută nu există

source: Ongoing awards, and their most recent winners:
ro: Premiere în desfăşurare şi cei mai recenţi câştigători:

source: won by
ro: câştigat de

source: recently won by
ro: câştigat recent de

source: for this
ro: pentru

source: Special awards:
ro: premii speciale

source: add
ro: adaugă

source: formatting help
ro: ajutor la formatare

source: you type:
ro: scrii:

source: you see:
ro: vezi:

source: italics
ro: italic

source: quoted text
ro: citat

source: all languages
ro: toate limbile

source: some languages
ro: câteva limbi

source: uploading
ro: încărcare

source: upload
ro: încarcă

source: fetching title...
ro: căutare titlu...

source: submitting...
ro: trimitere...

source: loading...
ro: încărcare...

source: get live %(site)s headlines on your site
ro: arată titluri din %(site)s pe site-ul tău

source: just cut and paste the generated code into your site and your specified %(site)s feed will be displayed and updated as new stories bubble up
ro: doar copy si paste codul generat pe site-ul tau si widgetul %(site)s va afisa si actualiza linkuri

source: which links do you want to display?
ro: ce linkuri ai dori sa fie afisate?

source: all-time
ro: din toate timpurile

source: submitted by
ro: trimise de

source: saved by
ro: salvate de

source: liked by
ro: plăcute

source: disliked by
ro: displăcute de

source: listing options
ro: opţiuni de afişare

source: links from %(domain)s
ro: linkuri de la %(domain)s

source: links %(submitted_by)s the user %(who)s
ro: linkuri %(submitted_by)s de %(who)s

source: links from the domain %(domain)s
ro: linkuri de pe domeniul %(domain)s

source: sorting options
ro: opţiuni de sortare

source: hottest
ro: cele mai fierbinţi

source: newest
ro: cele mai noi

source: sort links by %(what)s
ro: sortează după %(what)s

source: date range includes %(when)s
ro: perioada include %(when)s

source: number of links to show
ro: numărul de linkuri afişate

source: remove css styling
ro: nu folosi css styling

source: (the widget will inherit all styles from the page)
ro: (widgetul va moşteni toate stilurile de pe pagină)

source: enable in-widget voting
ro: permite voturile în widget

source: (will slow down the rendering)
ro: (va încetini afişarea)

source: two columns
ro: două coloane

source: background color
ro: culoare de fundal

source: (e.g., FF0000 = red)
ro: (de exemplu, FF0000 = roşu)

source: border color
ro: culoarea marginii
